### In this notebook I will try to build a basic Data Engineering project

In [1]:
import pandas as pd
import numpy as np

In [2]:
spotify_data = pd.read_csv('spotify_dataset.csv', on_bad_lines='skip', low_memory=False) #there might be error in csv file so we use this
user_data = pd.read_csv('UserData_13May2023.csv')

In [3]:
spotify_data.head()

,user_id,"""artistname""","""trackname""","""playlistname"""
0,9cc0cfd4d7d7885102480dd99e7a90d6,Elvis Costello,(The Angels Wanna Wear My) Red Shoes,HARD ROCK 2010
1,9cc0cfd4d7d7885102480dd99e7a90d6,Elvis Costello & The Attractions,"(What's So Funny 'Bout) Peace, Love And Unders...",HARD ROCK 2010
2,9cc0cfd4d7d7885102480dd99e7a90d6,Tiffany Page,7 Years Too Late,HARD ROCK 2010
3,9cc0cfd4d7d7885102480dd99e7a90d6,Elvis Costello & The Attractions,Accidents Will Happen,HARD ROCK 2010
4,9cc0cfd4d7d7885102480dd99e7a90d6,Elvis Costello,Alison,HARD ROCK 2010

In [4]:
user_data.head()

,_id,name,email,company,country,phone_number,designation,password,regitime,endtime,role,type,restriction,phone
0,645f81341fc0ecc0dd348626,Ahmed Hasibul Hasan,hasibahmed@outlook.com,Panna Traders,Bangladesh,+8801705110740,Executive Director,$2b$12$JXY0PEQlWuKiWY4yEyrxX.3mzMdWjp7OttDaeH5...,2023-05-13T18:23:16.249000,2023-06-12T18:23:16.249000,individual_user,basic,0.0,NaN
1,645bdfed1fc0ecc0dd348625,Asif Iqbal,asifiqbal9060@gmail.com,University of Chittagong,Bangladesh,01872379060,Student,$2b$12$adKDTEZSSWTchH1loQPi6OJhoyvyL0SgB8.qAP....,2023-05-11T00:18:21.320000,2023-06-10T00:18:21.320000,individual_user,basic,0.0,NaN
2,645b33731fc0ecc0dd348624,Aftab,aftabpulok@gmail.com,sowspot,Bangladesh,01974259093,student,$2b$12$wASiGcFQWvoDF0WUcURZwuML7QmRQ/m7JuTWYla...,2023-05-10T12:02:27.927000,2023-06-09T12:02:27.927000,individual_user,basic,0.0,NaN
3,645a42651fc0ecc0dd348623,Tushar Chandra Datta,tusharchandradatta@gmail.com,none,Bangladesh,NaN,NaN,$2b$12$eCWc2XWd0RnoVB5UoiWOhOgvFW2syjUNCqvghPL...,2023-05-09T18:53:57.045000,2023-06-08T18:53:57.045000,individual_user,basic,0.0,NaN
4,645748361fc0ecc0dd348622,Pallabi Siddiqua,pallabisiddiqua@du.ac.bd,University of Dhaka,Bangladesh,+8801811444333,Associate Professor,$2b$12$PFL37OuGCnOD1b1576JYP.7g9FjcXJDIzPkRP.d...,2023-05-07T12:41:58.442000,2023-06-06T12:41:58.442000,individual_user,basic,0.0,NaN

In [5]:
spotify_data.describe()

,user_id,"""artistname""","""trackname""","""playlistname"""
count,12891680,12858108,12891592,12890434
unique,15918,289820,2032043,157504
top,4398de6902abde3351347b048fcdc287,Daft Punk,Intro,Starred
freq,295275,36086,6676,1337085

In [6]:
spotify_data.isna().sum()

user_id                0
 "artistname"      33572
 "trackname"          88
 "playlistname"     1246
dtype: int64

In [7]:
spotify_data.isnull().sum()

user_id                0
 "artistname"      33572
 "trackname"          88
 "playlistname"     1246
dtype: int64

In [8]:
spotify_data = spotify_data.dropna()

In [9]:
spotify_data.isna().sum()

user_id            0
 "artistname"      0
 "trackname"       0
 "playlistname"    0
dtype: int64

In [10]:
user_data.describe()

       restriction
count  1203.000000
mean      0.008313
std       0.090831
min       0.000000
25%       0.000000
50%       0.000000
75%       0.000000
max       1.000000

In [11]:
user_data.isna().sum()

_id                0
name               0
email              0
company           20
country          616
phone_number    1143
designation       26
password           0
regitime           0
endtime            0
role               0
type               1
restriction       38
phone            731
dtype: int64

In [12]:
user_data.isnull().sum()

_id                0
name               0
email              0
company           20
country          616
phone_number    1143
designation       26
password           0
regitime           0
endtime            0
role               0
type               1
restriction       38
phone            731
dtype: int64

In [13]:
user_data = user_data.dropna()

In [14]:
spotify_data = spotify_data.drop_duplicates()

In [15]:
user_data = user_data.drop_duplicates()

In [16]:
spotify_data = spotify_data.drop(['user_id'], axis=1)

In [17]:
user_data = user_data.drop(['_id'], axis=1)

In [18]:
#MySQL connection
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="demouser",
  password="demo",
  database = "dataengineer"
)

In [22]:
mycursor = mydb.cursor()

mycursor.execute("CREATE TABLE IF NOT EXISTS spotify (id INT AUTO_INCREMENT PRIMARY KEY, artist VARCHAR(255), track VARCHAR(255), playlist VARCHAR(255))")
mycursor.execute("CREATE TABLE IF NOT EXISTS user (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), email VARCHAR(255), company VARCHAR(255), \
                 country VARCHAR(255), phone_number VARCHAR(255), designation VARCHAR(255), password VARCHAR(255), regi_time VARCHAR(255), \
                 end_time VARCHAR(255), role VARCHAR(255), type VARCHAR(255), restriction VARCHAR(255), phone VARCHAR(255))")
mydb.commit()